mhightower83/Arduino/cores/esp8266/umm_malloc/umm_malloc.cpp
 * Then we call free() with the adress of the data portion of the new
 * block (s) which adds it to the free list.
 *
 * ----------------------------------------------------------------------------
 */

#include <stdio.h>
#include <string.h>
#include <pgmspace.h>
#include "umm_malloc.h"

#include "umm_malloc_cfg.h"   /* user-dependent */


// class RomUartSelect {
//   UartSelect(unsigned char uart_num) {
// #ifdef DEBUG_ESP_PORT
//     if (strcmp("Serial1", __STRINGIFY(DEBUG_ESP_PORT) == 0) {
//       uart_buff_switch(1);
//     } else {
//       uart_buff_switch(0);
//     }
// #else
//     uart_buff_switch(0);
// #endif
//   }
// }
// RomUartSelect initUart();

extern "C" {

#include <esp8266_peri.h>

#if (UMM_ALT_CRITICAL_METHOD == 2)
static struct _UMM_TIME_STATS time_stats = {
  {0xFFFFFFFF, 0U, 0U, 0U},
  {0xFFFFFFFF, 0U, 0U, 0U},
  {0xFFFFFFFF, 0U, 0U, 0U},
  {0xFFFFFFFF, 0U, 0U, 0U},
  {0xFFFFFFFF, 0U, 0U, 0U} };

bool ICACHE_FLASH_ATTR get_umm_get_perf_data(struct _UMM_TIME_STATS *p, size_t size) {
    if (p && size != 0) {
        uint32_t save_ps = XTOS_SET_MIN_INTLEVEL(DEFAULT_INTR_DISABLE_LEVEL);
        memcpy(p, &time_stats, size);
        XTOS_RESTORE_INTLEVEL(save_ps);
        return true;
    }
    return false;
}
#endif

// Printing from the malloc routines is tricky. Since a lot of library calls
// will want to do malloc.
#if 1 //defined(DEBUG_ESP_PORT) && ( defined(DEBUG_ESP_CORE) || defined(DEBUG_ESP_OOM) )
/*
  Objective:  To be able to print "last gasp" diagnostic messages
  when interrupts are disabled and w/o availability of heap resources.
*/

void system_soft_wdt_feed(void); // <user_interface.h>
constexpr uint32_t WDT_TIME_TO_FEED = (400000UL*( F_CPU / 1000000UL )); // 0.4 secs.
static uint32_t wdt_last_feeding;
#if !(UMM_ALT_CRITICAL_METHOD == 2)
static inline uint32_t GetCycleCount() {
  uint32_t ccount;
  __asm__ __volatile__("esync; rsr %0,ccount":"=a"(ccount));
  return ccount;
}
#endif

// ROM _putc1, ignores CRs and sends CR/LF for LF, newline.
// Always returns character sent.
constexpr int (*_putc)(int) = (int (*)(int))0x40001dcc;

static int ICACHE_RAM_ATTR _local_putc(int c) {
  if ((GetCycleCount() - wdt_last_feeding) >= WDT_TIME_TO_FEED) {
    system_soft_wdt_feed();
    wdt_last_feeding = GetCycleCount();
  }
  return _putc(c);
}

int _sz_printf_P(const size_t buf_len, const char *fmt, ...) __attribute__((format(printf, 2, 3)));
int _sz_printf_P(const size_t buf_len, const char *fmt, ...) {
  system_soft_wdt_feed();
  wdt_last_feeding = GetCycleCount();

  char __aligned(4) ram_buf[buf_len];
  ets_memcpy(ram_buf, fmt, buf_len);
  va_list argPtr;
  va_start(argPtr, fmt);
  int result = ets_vprintf(&_local_putc, ram_buf, argPtr);
  va_end(argPtr);
  return result;
}

#define printf(fmt, ...) _sz_printf_P((sizeof(fmt) + 3) & ~0x03U, PSTR(fmt), ##__VA_ARGS__)
#else

// #define printf(fmt, ...) do { } while (false)
#define printf(fmt, ...) \
  do {  \
    static const char fstr[] PROGMEM = fmt; \
    char rstr[((sizeof(fmt) + 3) & ~0x03U)]; \
    os_memcpy(rstr, fstr, sizeof(rstr)); \
    printf(rstr, ##__VA_ARGS__); \
  } while (0)
#endif

// From UMM, the last caller of a malloc/realloc/calloc which failed:
extern void *umm_last_fail_alloc_addr;
extern int umm_last_fail_alloc_size;

#ifndef UMM_FIRST_FIT
#  ifndef UMM_BEST_FIT
#    define UMM_BEST_FIT
#  endif
#endif

#ifndef DBG_LOG_LEVEL
#  undef  DBG_LOG_LEVEL
#  define DBG_LOG_LEVEL 0
#else
#  undef  DBG_LOG_LEVEL
#  define DBG_LOG_LEVEL DBG_LOG_LEVEL
#endif


// This macro resulted in a crash when calling umm_info(..., true);
// Macro to place constant strings into PROGMEM and print them properly
// #define printf(fmt, ...)  do { static const char fstr[] PROGMEM = fmt; char rstr[sizeof(fmt)]; for (size_t i=0; i<sizeof(rstr); i++) rstr[i] = fstr[i]; printf(rstr, ##__VA_ARGS__); } while (0)

/* -- dbglog {{{ */

/* ----------------------------------------------------------------------------
 *            A set of macros that cleans up code that needs to produce debug
 *            or log information.
 *
 * See copyright notice in LICENSE.TXT
 * ----------------------------------------------------------------------------
 *
 * There are macros to handle the following decreasing levels of detail:
 *
 * 6 = TRACE
 * 5 = DEBUG
 * 4 = CRITICAL
 * 3 = ERROR
 * 2 = WARNING
 * 1 = INFO
 * 0 = FORCE - The printf is always compiled in and is called only when
 *              the first parameter to the macro is non-0
 *
 * ----------------------------------------------------------------------------
 *
 * The following #define should be set up before this file is included so
 * that we can be sure that the correct macros are defined.
 *
 * #define DBG_LOG_LEVEL x
 * ----------------------------------------------------------------------------
 */

#undef DBG_LOG_TRACE
#undef DBG_LOG_DEBUG
#undef DBG_LOG_CRITICAL
#undef DBG_LOG_ERROR
#undef DBG_LOG_WARNING
#undef DBG_LOG_INFO
#undef DBG_LOG_FORCE

/* ------------------------------------------------------------------------- */

#if DBG_LOG_LEVEL >= 6
#  define DBG_LOG_TRACE( format, ... ) printf( format, ## __VA_ARGS__ )
#else
#  define DBG_LOG_TRACE( format, ... )
#endif

#if DBG_LOG_LEVEL >= 5
#  define DBG_LOG_DEBUG( format, ... ) printf( format, ## __VA_ARGS__ )
#else
#  define DBG_LOG_DEBUG( format, ... )
#endif

#if DBG_LOG_LEVEL >= 4
#  define DBG_LOG_CRITICAL( format, ... ) printf( format, ## __VA_ARGS__ )
#else
#  define DBG_LOG_CRITICAL( format, ... )
#endif

#if DBG_LOG_LEVEL >= 3
#  define DBG_LOG_ERROR( format, ... ) printf( format, ## __VA_ARGS__ )
#else
#  define DBG_LOG_ERROR( format, ... )
#endif

#if DBG_LOG_LEVEL >= 2
#  define DBG_LOG_WARNING( format, ... ) printf( format, ## __VA_ARGS__ )
#else
#  define DBG_LOG_WARNING( format, ... )
#endif

#if DBG_LOG_LEVEL >= 1
#  define DBG_LOG_INFO( format, ... ) printf( format, ## __VA_ARGS__ )
#else
#  define DBG_LOG_INFO( format, ... )
#endif

#if 1 //defined(DEBUG_ESP_PORT) || defined(DEBUG_ESP_CORE)
#define DBG_LOG_FORCE( force, format, ... ) {if(force) {printf( format, ## __VA_ARGS__  );}}
#else
#define DBG_LOG_FORCE( ... ) do {} while(false)
#endif
/* }}} */

/* ------------------------------------------------------------------------- */

UMM_H_ATTPACKPRE typedef struct umm_ptr_t {
  unsigned short int next;
  unsigned short int prev;
} UMM_H_ATTPACKSUF umm_ptr;


UMM_H_ATTPACKPRE typedef struct umm_block_t {
  union {
    umm_ptr used;
  } header;
  union {
    umm_ptr free;
    unsigned char data[4];
  } body;
} UMM_H_ATTPACKSUF umm_block;

