mhightower83/Arduino/cores/esp8266/umm_malloc/umm_malloc.cpp
    UMM_CRITICAL_ENTRY(id_realloc); // added
  }

  /* Now calculate the block size again...and we'll have three cases */

  blockSize = (UMM_NBLOCK(c) - c);

  if( blockSize == blocks ) {
    /* This space intentionally left blank - return the original pointer! */

    DBG_LOG_DEBUG( "realloc the same size block - %d, do nothing\n", blocks );

  } else if (blockSize > blocks ) {
    /*
     * New block is smaller than the old block, so just make a new block
     * at the end of this one and put it up on the free list...
     */

    DBG_LOG_DEBUG( "realloc %d to a smaller block %d, shrink and free the leftover bits\n", blockSize, blocks );

    umm_make_new_block( c, blocks, 0, 0 );
    //?? is it safe to unlock here ??
    // TODO: Confirm the current block and this new block are in an issolated
    // like state. As if they were allocated. That being the case we should
    // be able to safely do a critical exit here before free, etc.
    // Reducing the interrupt lockout period.
    UMM_CRITICAL_EXIT(id_realloc);

    _umm_free( (void *)&UMM_DATA(c+blocks) );

    return( ptr );
    //? intlevel=0, looks okay - we are on our way out from here
  } else {
    /* New block is bigger than the old block... */

    void *oldptr = ptr;

    DBG_LOG_DEBUG( "realloc %d to a bigger block %d, make new, copy, and free the old\n", blockSize, blocks );

    /*
     * Now _umm_malloc() a new/ one, copy the old data to the new block, and
     * free up the old block, but only if the malloc was sucessful!
     */

    UMM_CRITICAL_EXIT(id_realloc); // added mjh May 23, 2019
    if( (ptr = _umm_malloc( size )) ) {
      //? old behavior intlevel=0, looks okay - we are on our way out from here
      memcpy( ptr, oldptr, curSize );
      _umm_free( oldptr );
      // UMM_CRITICAL_ENTRY(saved_ps);
    }
    return( ptr );

  }

  /* Release the critical section... */
  UMM_CRITICAL_EXIT(id_realloc);

  return( ptr );
}

/* ------------------------------------------------------------------------ */

void *umm_malloc( size_t size ) {
  void *ret;

  /* check poison of each blocks, if poisoning is enabled */
  if (!CHECK_POISON_ALL_BLOCKS()) {
    return NULL;
  }

  /* check full integrity of the heap, if this check is enabled */
  if (!INTEGRITY_CHECK()) {
    return NULL;
  }

  size += POISON_SIZE(size);

  ret = _umm_malloc( size );
  if (0 != size && 0 == ret) {
    umm_last_fail_alloc_addr = __builtin_return_address(0);
    umm_last_fail_alloc_size = size;
  }

  ret = GET_POISONED(ret, size);

  return ret;
}

/* ------------------------------------------------------------------------ */

void *umm_calloc( size_t num, size_t item_size ) {
  void *ret;
  size_t size = item_size * num;

  /* check poison of each blocks, if poisoning is enabled */
  if (!CHECK_POISON_ALL_BLOCKS()) {
    return NULL;
  }

  /* check full integrity of the heap, if this check is enabled */
  if (!INTEGRITY_CHECK()) {
    return NULL;
  }

  size += POISON_SIZE(size);
  ret = _umm_malloc(size);
  if (ret) {
    memset(ret, 0x00, size);
  }
  if (0 != size && 0 == ret) {
    umm_last_fail_alloc_addr = __builtin_return_address(0);
    umm_last_fail_alloc_size = size;
  }

  ret = GET_POISONED(ret, size);

  return ret;
}

/* ------------------------------------------------------------------------ */

void *umm_realloc( void *ptr, size_t size ) {
  void *ret;

  ptr = GET_UNPOISONED(ptr);

  /* check poison of each blocks, if poisoning is enabled */
  if (!CHECK_POISON_ALL_BLOCKS()) {
    return NULL;
  }

  /* check full integrity of the heap, if this check is enabled */
  if (!INTEGRITY_CHECK()) {
    return NULL;
  }

  size += POISON_SIZE(size);
  ret = _umm_realloc( ptr, size );
  if (0 != size && 0 == ret) {
    umm_last_fail_alloc_addr = __builtin_return_address(0);
    umm_last_fail_alloc_size = size;
  }

  ret = GET_POISONED(ret, size);

  return ret;
}

/* ------------------------------------------------------------------------ */

void umm_free( void *ptr ) {

  ptr = GET_UNPOISONED(ptr);

  /* check poison of each blocks, if poisoning is enabled */
  if (!CHECK_POISON_ALL_BLOCKS()) {
    return;
  }

  /* check full integrity of the heap, if this check is enabled */
  if (!INTEGRITY_CHECK()) {
    return;
  }

  _umm_free( ptr );
}

/* ------------------------------------------------------------------------ */

size_t ICACHE_FLASH_ATTR umm_free_heap_size( void ) {
  umm_info(NULL, 0);
  return (size_t)ummHeapInfo.freeBlocks * sizeof(umm_block);
}

size_t ICACHE_FLASH_ATTR umm_max_block_size( void ) {
  umm_info(NULL, 0);
  return ummHeapInfo.maxFreeContiguousBlocks * sizeof(umm_block);
}

size_t ICACHE_FLASH_ATTR umm_block_size( void ) {
  return sizeof(umm_block);
}

};

/* ------------------------------------------------------------------------ */
